In [37]:
import pandas as pd

# 1.什么是 DataFrame

DataFrame是一个表格型的数据结构，它含有一组有序的列，每列可以是不同的值类型（数值、字符串、布尔值等）。
DataFrame既有行索引也有列索引，它可以被看做由series组成的字典（共用同一个索引）
可以理解成一个表

In [2]:
# sample

In [4]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

# 2.如何创建DataFrame

In [38]:
# data

# 1.ndarray np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
# 2.dict

In [40]:
import numpy as np

In [41]:
arr = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

In [46]:
df = pd.DataFrame(arr,columns=['a','b','c'],index=['d','e','f'])

In [47]:
df

   a  b  c
d  1  2  3
e  4  5  6
f  7  8  9

In [48]:
df_dict = {'state': {0: 'Ohio', 1: 'Ohio', 2: 'Ohio', 3: 'Nevada', 4: 'Nevada'},
           'year': {0: 2000, 1: 2001, 2: 2002, 3: 2001, 4: 2002},
           'pop': {0: 1.5, 1: 1.7, 2: 3.6, 3: 2.4, 4: 2.9}}

In [50]:
df2 = pd.DataFrame(df_dict)

In [51]:
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

# 3.DataFrame 常见操作

In [14]:
# head 查看头数据
# tail 查看尾数据

In [56]:
df2.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [59]:
df2.tail(3)

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [61]:
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [19]:
# info 查看数据结构 及 储存信息

In [60]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   5 non-null      object
 1   year    5 non-null      int64
 2   pop     5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [ ]:
# describe 查看数据按列的统计信息

In [62]:
df2.describe()

             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

In [ ]:
# mean   返回每一列的均值
# median 返回每一列的中位数

In [63]:
df2.mean()

year    2001.20
pop        2.42
dtype: float64

In [64]:
df2.median()

year    2001.0
pop        2.4
dtype: float64

In [21]:
# index 获取行索引

In [65]:
df2.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [25]:
# columns 获取列索引

In [66]:
df2.columns

Index(['state', 'year', 'pop'], dtype='object')

In [26]:
# T 转置 
# index 与 columns 对调

In [67]:
df2.T

          0     1     2       3       4
state  Ohio  Ohio  Ohio  Nevada  Nevada
year   2000  2001  2002    2001    2002
pop     1.5   1.7   3.6     2.4     2.9

In [ ]:
# 排序
# sort_index  
  # 0 --> index
  # 1 --> column
# sort_values

In [68]:
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [70]:
df2.sort_index(axis=0,ascending=False)

    state  year  pop
4  Nevada  2002  2.9
3  Nevada  2001  2.4
2    Ohio  2002  3.6
1    Ohio  2001  1.7
0    Ohio  2000  1.5

In [72]:
df2.sort_index(axis=1,ascending=True)

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002